Revit 2027 API
View.AreAnalyticalModelCategoriesHidden Property
 Indicates if analytical model categories are currently hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreAnalyticalModelCategoriesHidden { get; set; }
Public Property AreAnalyticalModelCategoriesHidden As Boolean
	Get
	Set
public:
property bool AreAnalyticalModelCategoriesHidden {
	bool get ();
	void set (bool value);
}
member AreAnalyticalModelCategoriesHidden : bool with get, set
Property Value
Boolean
 True if analytical model categories are currently hidden in the view, false otherwise.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace